emacs/.emacs.d/config.org
#+title Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el

* Variables

#+begin_src emacs-lisp

  (defvar eli/default-font-size 130)
  (defvar eli/default-variable-font-size 130)
  (defvar eli/frame-transparency '(90 . 90))
  (defvar eli/default-font "FiraCode Nerd Font")
  (defvar eli/default-variable-font "Fira Sans Book")

#+end_src

* Startup Performance

#+begin_src emacs-lisp

  (setq gc-cons-threshold (* 50 1000 1000))

  (defun eli/display-startup-time ()
    (message "Emacs loaded in %s with %d garbage collections."
             (format "%.2f seconds"
                     (float-time
                       (time-subtract after-init-time before-init-time)))
             gcs-done))

  (add-hook 'emacs-startup-hook #'eli/display-startup-time)

#+end_src

* Package Management

** use-package

#+begin_src emacs-lisp
  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("nongnu" . "https://elpa.nongnu.org/nongnu/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))

  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))

  ;; Non-Linux
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (require 'use-package)
  ;; ensures packages are always downloaded
  (setq use-package-always-ensure t)
  ;; (setq use-package-verbose t)

#+end_src

** Automatic Package Updates

#+begin_src emacs-lisp

  (use-package auto-package-update
    :custom
    (auto-package-update-interval 7)
    (auto-package-update-prompt-before-update t)
    (auto-package-update-hide-results t)
    :config
    (auto-package-update-maybe)
    (auto-package-update-at-time "09:00"))

#+end_src

* Keep Folders Clean

#+begin_src emacs-lisp

  (use-package no-littering)

  ;; no-littering doesn't set this by default so we must place
  ;; auto save files in the same path as it uses for sessions
  (setq auto-save-file-name-transforms
        `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))

  ;; Prevent customization variables to be put here
  (setq custom-file (locate-user-emacs-file "custom-vars.el"))
  (load custom-file 'noerror 'nomessage)

#+end_src

* UI and Theming

** Theme
#+begin_src emacs-lisp

  (setq inhibit-startup-message t)
  (setq ring-bell-function 'ignore)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (menu-bar-mode -1)
  (setq display-line-numbers-type 'relative)
  (global-display-line-numbers-mode t)
  (setq use-dialog-box nil)
  (column-number-mode)
  (set-fringe-mode 10)
  (dolist (mode '(org-mode-hook
                  term-mode-hook
                  vterm-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))

  (use-package doom-themes
    :config
    (load-theme 'doom-gruvbox t)

    ;; Corrects (and improves) org-mode's native fontification.
    (doom-themes-org-config))

  ;; run M-x all-the-icons-install-fonts
  (use-package all-the-icons)

  (use-package doom-modeline
    :init (doom-modeline-mode 1)
    :custom ((doom-modeline-height 35)))

  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))

#+end_src

** Font Configuration

#+begin_src emacs-lisp

  (defun eli/set-font-faces ()
    ;; 한국!
    (set-fontset-font "fontset-default" 'hangul "Noto Sans CJK KR Regular")
    (set-face-attribute 'default nil :font eli/default-font :height eli/default-font-size)
    (set-face-attribute 'fixed-pitch nil :font eli/default-font :height eli/default-font-size)

    (set-face-attribute 'variable-pitch nil :font eli/default-variable-font :height eli/default-variable-font-size :weight 'regular))

  (if (daemonp)
    (add-hook 'after-make-frame-functions
      (lambda (frame)
        (setq doom-modeline-icon t)
        (with-selected-frame frame
        (eli/set-font-faces))))
    (eli/set-font-faces))

#+end_src

** LaTeX

#+begin_src emacs-lisp

  (setq org-format-latex-options '(:foreground default :background default :scale 2.0 :html-foreground "Black" :html-background "Transparent" :html-scale 1.0 :matchers
             ("begin" "$1" "$" "$$" "\\(" "\\[")))

#+end_src

Depends on =texlive-latex-base=, =texlive-latex-extra=, =dvipng=.

** Dashboard

#+begin_src emacs-lisp

  (use-package dashboard
    :config
    (dashboard-setup-startup-hook)
    (setq dashboard-banner-logo-title "Welcome, Eli.")
    (setq dashboard-set-heading-icons t)
    (setq dashboard-set-file-icons t)
    (setq dashboard-startup-banner 'logo)
    (setq dashboard-set-footer nil)
    (setq dashboard-projects-switch-function 'counsel-projectile-switch-project-by-name)
    (setq dashboard-item-names '(("Agenda for the coming week:" . "Agenda:")))
    (setq dashboard-center-content t)
    (setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))
    (setq dashboard-items '((recents  . 5)
                            (projects . 5)
                            (agenda . 5))))

  (defun eli/goto-dashboard ()
    (interactive)
    (switch-to-buffer "*dashboard*"))

#+end_src

* Persistent History

#+begin_src emacs-lisp

  (recentf-mode 1)
  (setq history-length 10)
  (savehist-mode 1)
  (save-place-mode 1)

#+end_src

* Refresh Buffers

#+begin_src emacs-lisp

  (global-auto-revert-mode 1)
  (setq global-auto-revert-non-file-buffers t)

#+end_src

* Undo Tree

#+begin_src emacs-lisp

  (use-package undo-tree
    :diminish undo-tree-mode
    :defer t
    :init (setq undo-tree-auto-save-history nil))
  (global-undo-tree-mode 1)

#+end_src

* Keybinds

** Custom

#+begin_src emacs-lisp

  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
  (global-set-key (kbd "<mouse-9>") 'evil-jump-forward)
  (global-set-key (kbd "<mouse-8>") 'evil-jump-backward)

#+end_src

** Evil Mode (Vim)

#+begin_src emacs-lisp

  (use-package evil
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-Y-yank-to-eol t)
    (setq evil-undo-system 'undo-tree)
    :config
    (evil-mode 1)
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line))

  ;; Evil Collection provides bindings for various community modes.
  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))

  (use-package evil-nerd-commenter
    :bind ("M-/" . evilnc-comment-or-uncomment-lines))

#+end_src

** General

#+begin_src emacs-lisp

  (use-package general
    :after evil
    :config
    (general-evil-setup t)
    (general-create-definer eli/leader-keys
      :keymaps '(normal insert visual emacs)
      :prefix "SPC"
      :global-prefix "C-SPC")
    (eli/leader-keys
      "h"  '(eli/goto-dashboard :which-key "homepage")
      "v"  '(vterm :which-key "vterm")
      "t"  '(:ignore t :which-key "toggles")
      "tc" '(counsel-load-theme :which-key "choose theme")
      "tl" '(org-latex-preview :which-key "toggle latex preview")
      "b"  '(counsel-ibuffer :which-key "buffer")
      "H"  '(previous-buffer :which-key "previous-buffer")
      "L"  '(next-buffer :which-key "next-buffer")
      "w"  '(:ignore w :which-key "window")
      "wh"  '(evil-window-left :which-key "window-left")
      "wj"  '(evil-window-down :which-key "window-down")
      "wk"  '(evil-window-up :which-key "window-up")
      "wl"  '(evil-window-right :which-key "window-right")
      "wv"  '(evil-window-vsplit :which-key "window-vsplit")
      "wf"  '(delete-other-windows :which-key "window-fullscreen")
      "R"  '(counsel-recentf :which-key "recent files")))

#+end_src

** Which-Key

#+begin_src emacs-lisp

  (use-package which-key
    :defer 0
    :diminish which-key-mode
    :config
    (which-key-mode)
    (setq which-key-idle-delay 0.2))

#+end_src

* Completion

** Ivy

#+begin_src emacs-lisp

  ;; Ivy, Swiper, and Counsel are designed to work well together.
  ;; Counsel depends on Ivy and Swiper, but Ivy has some extra configuration.
  (use-package ivy
    :diminish ;; Hides ivy-mode in the list of modes in the modeline
    :bind (("C-s" . swiper)
           :map ivy-minibuffer-map
           ("TAB" . ivy-alt-done)
           ("C-l" . ivy-alt-done)
           ("C-j" . ivy-next-line)
           ("C-k" . ivy-previous-line)
           :map ivy-switch-buffer-map
           ("C-k" . ivy-previous-line)
           ("C-l" . ivy-done)
           ("C-d" . ivy-switch-buffer-kill)
           :map ivy-reverse-i-search-map
           ("C-k" . ivy-previous-line)
           ("C-d" . ivy-reverse-i-search-kill))
    :config
    (ivy-mode 1))

  ;; Provides context within the minibuffer
  (use-package ivy-rich
    :after ivy
    :init
    (ivy-rich-mode 1))

#+end_src

** Counsel

#+begin_src emacs-lisp

  (use-package counsel
    :bind (("M-x" . counsel-M-x)
           ("C-x b" . counsel-ibuffer)
           ("C-x C-f" . counsel-find-file)
           :map minibuffer-local-map
           ("C-r" . 'counsel-minibuffer-history))
    :config
    (counsel-mode 1))

#+end_src

** Helpful

#+begin_src emacs-lisp

  (use-package helpful
    :commands (helpful-callable helpful-variable helpful-command helpful-key)
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))
#+end_src

