emacs/.emacs.d/config.org
** Ivy Prescient
For remembering frequent selections

#+begin_src emacs-lisp

  (use-package ivy-prescient
    :after counsel
    :custom
    (ivy-prescient-enable-filtering nil)
    :config
    ;; Uncomment the following line to have sorting remembered across sessions!
    (prescient-persist-mode 1)
    (ivy-prescient-mode 1))

#+end_src

* Project Management

** Projectile

#+begin_src emacs-lisp

  ;; C-c p f projectile-find-file
  ;; C-c p s r counsel-projectile-rg (use C-c o to move this into a buffer)
  (use-package projectile
    :diminish projectile-mode
    :config (projectile-mode)
    :custom ((projectile-completion-system 'ivy))
    :bind-keymap
    ("C-c p" . projectile-command-map))
    ;; NOTE: Set this to the folder where you keep your Git repos!
    ;; :init
    ;; (when (file-directory-p "~/Projects/Code")
    ;;   (setq projectile-project-search-path '("~/Projects/Code")))
    ;; (setq projectile-switch-project-action #'projectile-dired)
  (eli/leader-keys
    "p" '(:keymap projectile-command-map :package projectile :which-key "projectile"))

#+end_src

** Counsel Integration

#+begin_src emacs-lisp

  (use-package counsel-projectile
    :after projectile
    :config (counsel-projectile-mode))

#+end_src

** Magit

#+begin_src emacs-lisp

  (use-package magit
    :commands magit-status
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))
  (eli/leader-keys
    "g" '(magit-status :which-key "magit"))

#+end_src

** Forge
Forge integrates GitHub features into emacs, such as issues.

* Org Mode

** Configure Babel Languages

#+begin_src emacs-lisp

  (with-eval-after-load 'org
    (org-babel-do-load-languages
      'org-babel-load-languages
      '((emacs-lisp . t)
        (python . t))))

#+end_src

** Auto-tangle Configuration Files

#+begin_src emacs-lisp

  ;; Tangle config.org when we save it
  (defun eli/org-babel-tangle-config ()
    (when (string-equal (buffer-file-name)
                        (expand-file-name "~/dotfiles-v3/emacs/.emacs.d/config.org"))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'eli/org-babel-tangle-config)))

#+end_src

** Setup

#+begin_src emacs-lisp


  (defun eli/org-font-setup ()
    ;; (font-lock-add-keywords 'org-mode
    ;;                         '(("^ *\\([-]\\) "
    ;;                            (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))
  ;; Set faces for heading levels
  (dolist (face '((org-level-1 . 1.2)
                  (org-level-2 . 1.1)
                  (org-level-3 . 1.0)
                  (org-level-4 . 1.0)
                  (org-level-5 . 1.0)
                  (org-level-6 . 1.0)
                  (org-level-7 . 1.0)
                  (org-level-8 . 1.0)))
    (set-face-attribute (car face) nil :font eli/default-font :weight 'regular :height (cdr face)))

  ;; Ensure that anything that should be fixed-pitch in Org files appears that way
  ;; (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
  ;; (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
  ;; (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
  ;; (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  ;; (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  ;; (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  ;; (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)
  )

  (defun eli/org-mode-setup()
    (org-indent-mode)
    ;; (variable-pitch-mode 1)
    (visual-line-mode 1)
    (eli/org-font-setup)
  )

  (defvar eli/org-agenda-files '("~/wikeli/20220521061448-agenda.org"
                                 "~/wikeli/20220521082425-archive.org"))

#+end_src

** Org Package

#+begin_src emacs-lisp

  (use-package org
    :commands (org-capture org-agenda)
    :hook (org-mode . eli/org-mode-setup)
    :config
    (setq org-ellipsis " ▾")
    (setq org-hide-emphasis-markers t)

    (setq org-agenda-start-with-log-mode t)
    (setq org-log-done 'time)
    (setq org-log-into-drawer t)

    (setq org-agenda-files eli/org-agenda-files)

    (setq org-refile-targets
      '(("~/wikeli/20220521082425-archive.org" :maxlevel . 1)))

    ;; Save Org buffers after refiling
    (advice-add 'org-refile :after 'org-save-all-org-buffers)

    (setq org-tag-alist
       '((:startgroup)
          ;; mutually exclusive tags
         (:endgroup)
         ("project" . ?p)
         ))

    (setq org-todo-keywords
      '((sequence "TODO(t)" "NEXT(n)" "IDEA(i)" "|" "DONE(d!)")))

    (setq org-agenda-custom-commands
      '(("d" "Dashboard"
         ((agenda "" ((org-deadline-warning-days 14)))
           (todo "NEXT"
             ((org-agenda-overriding-header "Next Tasks")))))))

    (setq org-capture-templates
      `(("t" "Task" entry (file+olp "~/wikeli/20220521061448-agenda.org" "Inbox")
              "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)
        ("p" "Phrase" entry (file+olp "~/wikeli/20220523112202-words_and_phrases.org" "Unsorted") "* %?" :empty-lines 1)))

    (require 'org-habit)
    (add-to-list 'org-modules 'org-habit)
    (setq org-habit-graph-column 60))

  (eli/leader-keys
    "o"  '(:ignore o :which-key "org")
    "oa" '(org-agenda :which-key "org-agenda")
    "oc" '(org-ctrl-c-ctrl-c :which-key "c c")
    "od" '(org-deadline :which-key "org-deadline")
    "og" '(counsel-org-tag :which-key "counsel-org-tag")
    "oi" '(org-time-stamp :which-key "org-time-stamp")
    "ol" '(org-insert-link :which-key "org-insert-link")
    "oo" '(org-capture :which-key "org-capture")
    "op" '(org-set-property :which-key "org-set-property")
    "or" '(org-refile :which-key "org-refile")
    "os" '(org-schedule :which-key "org-schedule")
    "ot" '(org-todo :which-key "org-todo"))

#+end_src

** Org Theming

*** Header Bullets

#+begin_src emacs-lisp

  (use-package org-bullets
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

#+end_src

*** Padding

#+begin_src emacs-lisp

  (defun eli/org-mode-visual-fill ()
    (setq visual-fill-column-width 100
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :hook (org-mode . eli/org-mode-visual-fill))

#+end_src

*** Structure Templates

#+begin_src emacs-lisp

  (with-eval-after-load 'org
    (require 'org-tempo)
    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("py" . "src python")))

#+end_src

** Org Roam

*** Pull to Agenda

#+begin_src emacs-lisp

    (defun eli/org-roam-filter-by-tag (tag-name)
      (lambda (node)
        (member tag-name (org-roam-node-tags node))))

    (defun eli/org-roam-list-notes-by-tag (tag-name)
      (mapcar #'org-roam-node-file
              (seq-filter
               (eli/org-roam-filter-by-tag tag-name)
               (org-roam-node-list))))

#+end_src

*** Org Roam Package
#+begin_src emacs-lisp

  (use-package org-roam
    :commands (org-capture org-agenda)
    :custom
    (org-roam-directory "~/wikeli")
    (org-roam-completion-everywhere t)
    :config
    (message "Loading Roam")
    (require 'org-roam-dailies)
    (org-roam-db-autosync-mode)

    (setq org-agenda-files
      (append eli/org-agenda-files
        (eli/org-roam-list-notes-by-tag "project")))

    (setq org-roam-node-display-template
      (concat "${title:40} "
        (propertize "${tags:*}" 'face 'org-tag)))

    (setq org-roam-dailies-directory "journal/")
    (setq org-link-frame-setup '((vm . vm-visit-folder-other-frame)
                                 (vm.imap . vm-visit-imap-folder-other-frame)
                                 (gnus . org-gnus-no-new-news)
                                 (file . find-file)
                                 (wl . wl-other-frame))))

  (general-define-key :keymaps 'org-mode-map "C-M-i" 'completion-at-point)

#+end_src

*** Insert Immediate

#+begin_src emacs-lisp

(defun org-roam-node-insert-immediate (arg &rest args)
  (interactive "P")
  (let ((args (cons arg args))
        (org-roam-capture-templates (list (append (car org-roam-capture-templates)
                                                  '(:immediate-finish t)))))
    (apply #'org-roam-node-insert args)))
  
#+end_src

*** Roam Keybinds
#+begin_src emacs-lisp

  (eli/leader-keys
    "r" '(:ignore r :which-key "org-roam")
    "rt" '(org-roam-buffer-toggle :which-key "buffer-toggle")
    "rf" '(org-roam-node-find :which-key "node-find")
    "ri" '(org-roam-node-insert :which-key "node-insert")
    "rI" '(org-roam-node-insert-immediate :which-key "node-insert-immediate")
    "ro" '(org-open-at-point :which-key "open-at-point")
    "rdY" '(org-roam-dailies-capture-yesterday :which-key "capture-yesterday")
    "rdT" '(org-roam-dailies-capture-tomorrow :which-key "capture-tomorrow")
    "rd" '(:keymap org-roam-dailies-map :package org-roam :which-key "dailies"))

#+end_src

* LSP
The Language Server Protocol (LSP) is a protocol for programming languages to communicate with editors.

** Configuration
#+begin_src emacs-lisp

  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :init
    (setq lsp-keymap-prefix "C-c l")
    :config
    (lsp-enable-which-key-integration t))

  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode)
    :custom
    (setq lsp-ui-doc-position 'bottom))
  
  (use-package lsp-treemacs
    :after lsp)

  (use-package lsp-ivy
    :after lsp)

  (eli/leader-keys
    "tt" '(treemacs :which-key "filetree")
    "lo" '(lsp-organize-imports :which-key "organize imports")
    "lR" '(lsp-treemacs-references :which-key "find references")
    "lr" '(lsp-rename :which-key "rename")
    "ld" '(lsp-find-definition :which-key "find definition")
    "lf" '(lsp-ivy-global-workspace-symbol :which-key "find symbol"))

#+end_src

** Autocomplete

#+begin_src emacs-lisp

  (use-package company
    :after lsp-mode
    :hook (lsp-mode . company-mode)
    :bind
    (:map company-active-map
          ("<tab>" . company-complete-section))
    (:map lsp-mode-map
          ("<tab>" . company-indent-or-complete-common))
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.0))

  (use-package company-box
    :hook (company-mode . company-box-mode))

#+end_src

** Languages

*** Python

Depends on =pyright=.

#+begin_src emacs-lisp

  (use-package python-mode
    :hook (python-mode . lsp-deferred))

#+end_src

* Terminals
