emacs/.emacs.d/init.el

(use-package ivy-prescient
  :after counsel
  :custom
  (ivy-prescient-enable-filtering nil)
  :config
  ;; Uncomment the following line to have sorting remembered across sessions!
  (prescient-persist-mode 1)
  (ivy-prescient-mode 1))

;; C-c p f projectile-find-file
;; C-c p s r counsel-projectile-rg (use C-c o to move this into a buffer)
(use-package projectile
  :diminish projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'ivy))
  :bind-keymap
  ("C-c p" . projectile-command-map))
  ;; NOTE: Set this to the folder where you keep your Git repos!
  ;; :init
  ;; (when (file-directory-p "~/Projects/Code")
  ;;   (setq projectile-project-search-path '("~/Projects/Code")))
  ;; (setq projectile-switch-project-action #'projectile-dired)

(use-package counsel-projectile
  :after projectile
  :config (counsel-projectile-mode))

(use-package magit
  :commands magit-status
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))
(eli/leader-keys
  "g" '(magit-status :which-key "magit"))

(with-eval-after-load 'org
  (org-babel-do-load-languages
    'org-babel-load-languages
    '((emacs-lisp . t)
      (python . t))))

;; Tangle config.org when we save it
(defun eli/org-babel-tangle-config ()
  (when (string-equal (buffer-file-name)
                      (expand-file-name "~/dotfiles-v3/emacs/.emacs.d/config.org"))
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'eli/org-babel-tangle-config)))

(defun eli/org-mode-setup()
  (org-indent-mode)
  (visual-line-mode 1))

(defun eli/org-font-setup ()
  (font-lock-add-keywords 'org-mode
                          '(("^ *\\([-]\\) "
                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•")))))))

(use-package org
  :commands (org-capture org-agenda)
  :hook (org-mode . eli/org-mode-setup)
  :config
  (setq org-ellipsis " ▾")
  (setq org-hide-emphasis-markers t)

  (setq org-agenda-start-with-log-mode t)
  (setq org-log-done 'time)
  (setq org-log-into-drawer t)

  (setq org-agenda-files
        '("" ""))
  (eli/org-font-setup))

(eli/leader-keys
  "o"  '(:ignore o :which-key "org")
  "ot" '(org-todo :which-key "org-todo")
  "oi" '(org-time-stamp :which-key "org-time-stamp")
  "og" '(counsel-org-tag :which-key "counsel-org-tag")
  "oa" '(org-agenda :which-key "org-agenda")
  "os" '(org-schedule :which-key "org-schedule"))

(use-package org-bullets
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

(defun eli/org-mode-visual-fill ()
  (setq visual-fill-column-width 100
        visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package visual-fill-column
  :hook (org-mode . eli/org-mode-visual-fill))

(with-eval-after-load 'org
  (require 'org-tempo)
  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python")))

(use-package org-roam
  :custom
  (org-roam-directory "~/wikeli")
  (org-roam-completion-everywhere t)
  :bind (("C-c n l" . org-roam-buffer-toggle)
         ("C-c n f" . org-roam-node-find)
         ("C-c n i" . org-roam-node-insert)
         :map org-mode-map
         ("C-M-i" . completion-at-point))
  :config
  (org-roam-setup)
  (setq org-link-frame-setup '((vm . vm-visit-folder-other-frame)
                              (vm.imap . vm-visit-imap-folder-other-frame)
                              (gnus . org-gnus-no-new-news)
                              (file . find-file)
                              (wl . wl-other-frame))))

(eli/leader-keys
  "r" '(:ignore r :which-key "org-roam")
  "rh" '(org-mark-ring-goto :which-key "buffer-toggle")
  "rl" '(org-mark-ring-goto -1 :which-key "buffer-toggle")
  "rt" '(org-roam-buffer-toggle :which-key "buffer-toggle")
  "rf" '(org-roam-node-find :which-key "node-find")
  "ri" '(org-roam-node-insert :which-key "node-insert"))

(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :init
  (setq lsp-keymap-prefix "C-c l")
  :config
  (lsp-enable-which-key-integration t))

(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :custom
  (setq lsp-ui-doc-position 'bottom))

(use-package lsp-treemacs
  :after lsp)

(use-package lsp-ivy
  :after lsp)

(eli/leader-keys
  "tt" '(treemacs :which-key "filetree")
  "lo" '(lsp-organize-imports :which-key "organize imports")
  "lR" '(lsp-treemacs-references :which-key "find references")
  "lr" '(lsp-rename :which-key "rename")
  "ld" '(lsp-find-definition :which-key "find definition")
  "lf" '(lsp-ivy-global-workspace-symbol :which-key "find symbol"))

(use-package company
  :after lsp-mode
  :hook (lsp-mode . company-mode)
  :bind
  (:map company-active-map
        ("<tab>" . company-complete-section))
  (:map lsp-mode-map
        ("<tab>" . company-indent-or-complete-common))
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.0))

(use-package company-box
  :hook (company-mode . company-box-mode))

(use-package python-mode
  :hook (python-mode . lsp-deferred))
