emacs/.emacs.d/config.org
** Term-mode

If you need to send specific keys into the terminal, you may need to use char mode by pressing `C-c C-k` and re-enter line mode by pressing `C-c C-j`

#+begin_src emacs-lisp

  (use-package term
    :commands term
    :config
    (setq explicit-shell-file-name "fish")
    (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *"))

#+end_src

*** Better colors

#+begin_src emacs-lisp

  (use-package eterm-256color
    :hook (term-mode . eterm-256color-mode))

#+end_src

** Vterm

Vterm is almost always better than term mode.

#+begin_src emacs-lisp

  (use-package vterm
    :commands vterm
    :config
    (setq vterm-shell "/bin/fish")
    (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *")
    (setq vterm-max-scrollback 10000))

#+end_src

Depends on =libvterm-dev=, =cmake=.

* Dired

** Primary Configuration 

#+begin_src emacs-lisp

  (use-package dired
    :ensure nil
    :hook (dired-mode . dired-hide-details-mode)
    :commands (dired dired-jump)
    :custom
    ((dired-listing-switches "-laD --group-directories-first"))
    :config
    (evil-collection-define-key 'normal 'dired-mode-map
       "h" 'dired-single-up-directory
       "l" 'dired-single-buffer))
  (eli/leader-keys
    "d" '(dired :which-key "dired"))

#+end_src

** Dired Buffer Control

#+begin_src emacs-lisp

  (use-package dired-single
    :after dired)

#+end_src

** Dired Icons

#+begin_src emacs-lisp

  (use-package all-the-icons-dired
    :hook (dired-mode . all-the-icons-dired-mode))

#+end_src

** Opening Specific Applications
You can use the package called dired-open to open files in a specific application, such as videos in VLC.

** Hiding Dotfiles

#+begin_src emacs-lisp

  (use-package dired-hide-dotfiles
    :hook (dired-mode . dired-hide-dotfiles-mode)
    :config
    (evil-collection-define-key 'normal 'dired-mode-map
      "H" 'dired-hide-dotfiles-mode))

#+end_src

* Runtime Performance

#+begin_src emacs-lisp

  (setq gc-cons-threshold (* 2 1000 1000))

#+end_src
